---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoValidElementSelected
source: html/27192143-b690-fdc2-f81c-d24da6046a49.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SelectionFailures.NoValidElementSelected Property

No valid element selected.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoValidElementSelected { get; }
```